
## Plan Result




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_api_diagnostic.api_logs[0]
  * azurerm_api_management_api_operation_policy.apim_api_operation_policy[&#34;sendOtpEmail&#34;]
  * azurerm_api_management_api_operation_policy.apim_api_operation_policy[&#34;welcome&#34;]
  * module.apim_api[0].azurerm_api_management_api.api
  * module.apim_api[0].azurerm_api_management_product_api.link_to_product[0]
  * module.apim_api_policy[0].azurerm_api_management_api_policy.api_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_api_diagnostic.api_logs[0] will be created
  + resource "azurerm_api_management_api_diagnostic" "api_logs" {
      + always_log_errors         = true
      + api_management_logger_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/loggers/sds-api-mgmt-stg-logger"
      + api_management_name       = "sds-api-mgmt-stg"
      + api_name                  = "pip-publication-services-api"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + operation_name_format     = "Name"
      + resource_group_name       = "ss-stg-network-rg"
      + sampling_percentage       = 25
      + verbosity                 = "verbose"

      + backend_request {
          + body_bytes     = 8192
          + headers_to_log = [
              + "accept",
              + "content-type",
            ]
        }

      + backend_response {
          + body_bytes     = 8192
          + headers_to_log = [
              + "content-length",
              + "content-type",
            ]
        }

      + frontend_request {
          + body_bytes     = 8192
          + headers_to_log = [
              + "accept",
              + "content-type",
            ]
        }

      + frontend_response {
          + body_bytes     = 8192
          + headers_to_log = [
              + "content-length",
              + "content-type",
            ]
        }
    }

  # azurerm_api_management_api_operation_policy.apim_api_operation_policy["sendOtpEmail"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pip-publication-services-api"
      + id                  = (known after apply)
      + operation_id        = "sendOtpEmail"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <validate-jwt token-value="@( (String) context.Request.Body.As<JObject>(preserveContent: true)["bearer"])" failed-validation-httpcode="401" failed-validation-error-message="Unauthorized. Access token is missing or invalid.">
                  <openid-config url="https://login.microsoftonline.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/v2.0/.well-known/openid-configuration" />
                  <required-claims>
                    <claim name="roles" match="any">
                      <value>apim.request.admin</value>
                      <value>api.publisher.user</value>
                      <value>api.publisher.admin</value>
                    </claim>
                  </required-claims>
                </validate-jwt>
                <cors>
                  <allowed-origins>
                    <origin>*</origin>
                  </allowed-origins>
                  <allowed-methods>
                    <method>GET</method>
                    <method>POST</method>
                  </allowed-methods>
                </cors>
                <choose>
                  <when condition="@(context.Request.Body.As<JObject>(preserveContent: true)["otp"] == null)">
                    <return-response>
                      <set-status code="400" />
                      <set-body>@{
                        return new JObject(
                          new JProperty("message", "OTP must be present in the request body.")
                        ).ToString();
                      }</set-body>
                    </return-response>
                  </when>
                  <when condition="@(string.IsNullOrEmpty(context.Request.Body.As<JObject>(preserveContent: true)["otp"].Value<string>()))">
                    <return-response>
                      <set-status code="400" />
                      <set-body>@{
                        return new JObject(
                        new JProperty("message", "OTP value must not be empty.")
                        ).ToString();
                        }</set-body>
                    </return-response>
                  </when>
                </choose>
                <base />
                <set-body>@{
                  return new JObject(
                    new JProperty("otp", (String) context.Request.Body.As<JObject>(preserveContent: true)["otp"]),
                    new JProperty("email", (String) context.Request.Body.As<JObject>(preserveContent: true)["email"])
                  ).ToString();
                }</set-body>
              </inbound>
              <backend>
                <base />
              </backend>
              <outbound>
                <base />
              </outbound>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # azurerm_api_management_api_operation_policy.apim_api_operation_policy["welcome"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pip-publication-services-api"
      + id                  = (known after apply)
      + operation_id        = "welcome"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <validate-jwt header-name="Authorization" failed-validation-httpcode="401" failed-validation-error-message="Unauthorized. Access token is missing or invalid.">
                  <openid-config url="https://login.microsoftonline.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/v2.0/.well-known/openid-configuration" />
                  <issuers>
                    <issuer>https://login.microsoftonline.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/v2.0</issuer>
                  </issuers>
                  <required-claims>
                    <claim name="roles" match="any" separator=",">
                      <value>api.publisher.admin</value>
                      <value>api.publisher.user</value>
                    </claim>
                  </required-claims>
                </validate-jwt>
                <cors>
                  <allowed-origins>
                    <origin>*</origin>
                  </allowed-origins>
                  <allowed-methods>
                    <method>GET</method>
                  </allowed-methods>
                </cors>
                <base />
              </inbound>
              <backend>
                <base />
              </backend>
              <outbound>
                <base />
              </outbound>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.apim_api[0].azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "sds-api-mgmt-stg"
      + api_type              = "http"
      + display_name          = "pip-publication-services-api"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "pip-publication-services-api"
      + path                  = "pip/publication-services"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "ss-stg-network-rg"
      + revision              = "1"
      + service_url           = "https://pip-publication-services.staging.platform.hmcts.net"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi+json"
          + content_value  = jsonencode(
                {
                  + components   = {
                      + schemas = {
                          + OtpEmail = {
                              + properties = {
                                  + email = {
                                      + type = "string"
                                    }
                                  + otp   = {
                                      + type = "string"
                                    }
                                }
                              + type       = "object"
                            }
                        }
                    }
                  + externalDocs = {
                      + description = "README"
                      + url         = "https://github.com/hmcts/pip-publication-services"
                    }
                  + info         = {
                      + description = "Use this service to send emails with Gov.UK Notify and send publications to third party systems"
                      + license     = {
                          + name = "MIT"
                          + url  = "https://opensource.org/licenses/MIT"
                        }
                      + title       = "CaTH Publication Services Service"
                      + version     = "1.0.0"
                    }
                  + openapi      = "3.0.1"
                  + paths        = {
                      + "/"           = {
                          + get = {
                              + operationId = "welcome"
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "*/*" = {
                                              + schema = {
                                                  + type = "string"
                                                }
                                            }
                                        }
                                      + description = "OK"
                                    }
                                }
                              + summary     = "Get Welcome"
                              + tags        = [
                                  + "Publication Services root API",
                                ]
                            }
                        }
                      + "/notify/otp" = {
                          + post = {
                              + operationId = "sendOtpEmail"
                              + requestBody = {
                                  + content  = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/OtpEmail"
                                            }
                                        }
                                    }
                                  + required = true
                                }
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "*/*" = {
                                              + schema = {
                                                  + type = "string"
                                                }
                                            }
                                        }
                                      + description = "OTP email successfully sent with referenceId: {Id}"
                                    }
                                  + "400" = {
                                      + content     = {
                                          + "*/*" = {
                                              + schema = {
                                                  + type = "string"
                                                }
                                            }
                                        }
                                      + description = "NotifyException error message"
                                    }
                                  + "403" = {
                                      + content     = {
                                          + "*/*" = {
                                              + schema = {
                                                  + type = "string"
                                                }
                                            }
                                        }
                                      + description = "User has not been authorised"
                                    }
                                }
                              + summary     = "Send email with B2C one-time password"
                              + tags        = [
                                  + "Publication Services notification API",
                                ]
                            }
                        }
                    }
                  + servers      = [
                      + {
                          + description = "Generated server url"
                          + url         = "https://pip-publication-services.staging.platform.hmcts.net"
                        },
                    ]
                }
            )
        }
    }

  # module.apim_api[0].azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pip-publication-services-api"
      + id                  = (known after apply)
      + product_id          = "pip-product-stg"
      + resource_group_name = "ss-stg-network-rg"
    }

  # module.apim_api_policy[0].azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pip-publication-services-api"
      + id                  = (known after apply)
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":393,"Program":"tfcmt","SHA1":"","Vars":{}} -->